ChrGri/DIY-Sim-Racing-FFB-Pedal/ESP32/src/Main.cpp
static SemaphoreHandle_t s_semaphore_updatePedalStates=NULL;



/**********************************************************************************************/
/*                                                                                            */
/*                         queue declarations                                                 */
/*                                                                                            */
/**********************************************************************************************/
// ADD THIS: The handle for our new FreeRTOS queue
static QueueHandle_t s_pedalStateQueue = NULL;
static QueueHandle_t s_joystickDataQueue = NULL;
static QueueHandle_t s_loadcellDataQueue = NULL;
static QueueHandle_t s_configUpdateAvailableQueue = NULL;
static QueueHandle_t s_configUpdateSendToPedalUpdateTaskQueue = NULL;
static QueueHandle_t s_configUpdateSendToLoadcellTaskQueue = NULL;
// static QueueHandle_t configUpdateSendToJoystickTaskQueue = NULL;
static QueueHandle_t s_configUpdateSendToSerialRXTaskQueue = NULL;



// ADD THIS: New data structure to send both states together in one package
typedef struct {
    DapStateBasic_t    basic_st;
    DapStateExtended_t extended_st;
    bool sendBasicFlag_b;
    bool sendExtendedFlag_b;
} PedalStatePackage_t;

typedef struct {
    uint16_t joystickNormalizedToUInt16;
    bool sendJoystickFlag_b;
} joystickDataPackage_t;

typedef struct {
    float loadcellReadingInKg_fl32;
} loadcellDataPackage_t;

typedef struct {
    DapConfig_t config_st;
} configDataPackage_t;



/**********************************************************************************************/
/*                                                                                            */
/*                         target-specific  definitions                                       */
/*                                                                                            */
/**********************************************************************************************/




/**********************************************************************************************/
/*                                                                                            */
/*                         controller  definitions                                            */
/*                                                                                            */
/**********************************************************************************************/

#include "Controller.h"




/**********************************************************************************************/
/*                                                                                            */
/*                         pedal mechanics definitions                                        */
/*                                                                                            */
/**********************************************************************************************/

#include "PedalGeometry.h"
float motorRevolutionsPerSteps_fl32 = 1.0f / 3200.0f;


/**********************************************************************************************/
/*                                                                                            */
/*                         Kalman filter definitions                                          */
/*                                                                                            */
/**********************************************************************************************/

#include "SignalFilter_1st_order.h"
KalmanFilter1stOrder* kalman = NULL;
KalmanFilter1stOrder* kalman_joystick = NULL;

#include "SignalFilter_2nd_order.h"
KalmanFilter2ndOrder* kalman_2nd_order = NULL;




/**********************************************************************************************/
/*                                                                                            */
/*                         loadcell definitions                                               */
/*                                                                                            */
/**********************************************************************************************/

#ifdef USES_ADS1220
  /*  Uses ADS1220 */
  #include "LoadCell_ads1220.h"
  LoadCellAds1220* loadcell = NULL;

#else
  /*  Uses ADS1256 */
  #include "LoadCell.h"
  LoadCellAds1256* loadcell = NULL;
#endif


/**********************************************************************************************/
/*                                                                                            */
/*                         stepper motor definitions                                          */
/*                                                                                            */
/**********************************************************************************************/

#include "StepperWithLimits.h"
StepperWithLimits* stepper = NULL;
//static const int32_t MIN_STEPS = 5;

#include "StepperMovementStrategy.h"
#include "StepperMovementStrategy_MPC.h"
#include "ChatterReduction.h"
bool moveSlowlyToPosition_b = true;
/**********************************************************************************************/
/*                                                                                            */
/*                         OTA                                                                */
/*                                                                                            */
/**********************************************************************************************/
//OTA update
#ifdef OTA_update
//#include "ota.h"
#include "OTA_Pull.h"
#include "OTA_ArduinoOTA.h"
char* g_apHost_pc;
#endif
#ifdef OTA_update_ESP32
  #include "ota.h"
  //#include "OTA_Pull.h"
  TaskHandle_t Task4;
  char* g_apHost_pc;
#endif

#if !defined(OTA_update) && !defined(OTA_update_ESP32)
  #include "ota.h"
#endif


//ESPNOW
#ifdef ESPNOW_Enable
  #include "ESPNOW_lib.h"
  TaskHandle_t Task6;
#endif

