ChrGri/DIY-Sim-Racing-FFB-Pedal/ESP32/src/Main.cpp
#ifdef USING_LED
  #include "soc/soc_caps.h"
  #include <Adafruit_NeoPixel.h>
  #define LEDS_COUNT 1
  #ifdef LED_ENABLE_RGB
    Adafruit_NeoPixel pixels(LEDS_COUNT, LED_GPIO_U8, NEO_RGB + NEO_KHZ800);
  #else
    Adafruit_NeoPixel pixels(LEDS_COUNT, LED_GPIO_U8, NEO_GRB + NEO_KHZ800);
  #endif
  #define CHANNEL 0
  #define LED_BRIGHT 30
  /*
  static const crgb_t L_RED = 0xff0000;
  static const crgb_t L_GREEN = 0x00ff00;
  static const crgb_t L_BLUE = 0x0000ff;
  static const crgb_t L_WHITE = 0xe0e0e0;
  static const crgb_t L_YELLOW = 0xffde21;
  static const crgb_t L_ORANGE = 0xffa500;
  static const crgb_t L_CYAN = 0x00ffff;
  static const crgb_t L_PURPLE = 0x800080;
  */
#endif


#include "Buzzer.h"
SimpleBuzzer Buzzer;
bool buzzerBeepAction_b = false;
#include <cstring>


/**********************************************************************************************/
/*                                                                                            */
/*                         profiler setup                                                     */
/*                                                                                            */
/**********************************************************************************************/
#include "FunctionProfiler.h"





/**********************************************************************************************/
/*                                                                                            */
/*                         config reading                                                     */
/*                                                                                            */
/**********************************************************************************************/
void IRAM_ATTR_FLAG configHandlingTask( void * pvParameters )
{
  DapConfig_t dap_config_st_local;
  configDataPackage_t configPackage_st;

  for (;;)
  {

    // check if config update is available
    if (xQueueReceive(s_configUpdateAvailableQueue, &configPackage_st, portMAX_DELAY) == pdPASS)
    {
      global_dap_config_class.setConfig(configPackage_st.config_st);

      ActiveSerial->println("Config update received: config handling task");

      // send queues to other tasks

      // Send the package to the queue. Use a timeout of 0 (non-blocking).
      // If the queue is full, the data is simply dropped. This prevents this
      // high-priority control task from ever blocking on a full serial buffer.
      xQueueSend(s_configUpdateSendToPedalUpdateTaskQueue, &configPackage_st, portMAX_DELAY);
      xQueueSend(s_configUpdateSendToLoadcellTaskQueue, &configPackage_st, portMAX_DELAY);
      // xQueueSend(configUpdateSendToJoystickTaskQueue, &configPackage_st, portMAX_DELAY);
      xQueueSend(s_configUpdateSendToSerialRXTaskQueue, &configPackage_st, portMAX_DELAY);

    }
  }
}



/**********************************************************************************************/
/*                                                                                            */
/*                         loadcell reading                                                   */
/*                                                                                            */
/**********************************************************************************************/
void IRAM_ATTR_FLAG loadcellReadingTask( void * pvParameters )
{

  static FunctionProfiler profiler_loadcellReading;
  profiler_loadcellReading.setName("loadcellReading");
  profiler_loadcellReading.setNumberOfCalls(3000);

  static float loadcellReading_fl32 = 0.0f;
  static DapConfig_t loadcellTask_dap_config_st;
  configDataPackage_t configPackage_st;

  static float previousLoadcellReadingInKg_fl32 = 0.0f;

  for (;;)
  {

    if (loadcell != NULL)
    {

      // if new data package is available, update the local config
      if (xQueueReceive(s_configUpdateSendToLoadcellTaskQueue, &configPackage_st, (TickType_t)0) == pdPASS)
      {
        loadcellTask_dap_config_st = configPackage_st.config_st;

        // activate profiler depending on pedal config
        if (loadcellTask_dap_config_st.payloadPedalConfig_st.debugFlags0_u8 & DEBUG_INFO_0_CYCLE_TIMER_U8) 
        {
          profiler_loadcellReading.activate( true );
        }
        else
        {
          profiler_loadcellReading.activate( false );
        }

        ActiveSerial->println("Update config: loadcell task");
      }     

      // start profiler 0, overall function
      profiler_loadcellReading.start(0);

      // no need for delay, since getReadingKg will block until DRDY edge down is detected
      loadcellReading_fl32 = loadcell->readLoadcellWeightInKg();

      // Invert the loadcell reading digitally if desired
      if (loadcellTask_dap_config_st.payloadPedalConfig_st.invertLoadcellReading_u8 == 1)
      {
        loadcellReading_fl32 *= -1.0f;
      }

      // detect loadcell outlier
      float loadcellDifferenceToLastCycle_fl32 = loadcellReading_fl32 - previousLoadcellReadingInKg_fl32;
      previousLoadcellReadingInKg_fl32 = loadcellReading_fl32;
      
      if (fabsf(loadcellDifferenceToLastCycle_fl32) < 5.0f)
      {
        // reject update when loadcell reading likely outlier
          
        // send joystick data to queue
        if (s_loadcellDataQueue != NULL)
        {

          // Package the new state data into a single struct
          loadcellDataPackage_t newLoadcellPackage;
          newLoadcellPackage.loadcellReadingInKg_fl32 = loadcellReading_fl32;

            // Send the package to the queue. Use a timeout of 0 (non-blocking).
            // If the queue is full, the data is simply dropped. This prevents this
            // high-priority control task from ever blocking on a full serial buffer.
          xQueueSend(s_loadcellDataQueue, &newLoadcellPackage, (TickType_t)0);
        }
      }
      
      
      


      profiler_loadcellReading.end(0);

      // print profiler results
      // profiler_loadcellReading.report();


