ChrGri/DIY-Sim-Racing-FFB-Pedal/ESP32/src/Main.cpp
            // activate profiler depending on pedal config
            if (sct_dap_config_st.payloadPedalConfig_st.debugFlags0_u8 & DEBUG_INFO_0_CYCLE_TIMER_U8) 
            {
              profiler_serialCommunicationTask.activate( true );
            }
            else
            {
              profiler_serialCommunicationTask.activate( false );
            }

            ActiveSerial->println("Update config: serial RX");
          }

          // ---- Attribute packet dispatcher (USE_VENDOR_HID only) ----
          // Drain all attribute packets that arrived since the last cycle.
          // Each WRITE packet updates the shadow config/action struct.
          // A COMMIT packet pushes the shadow to the global config queue.
          #ifdef USE_VENDOR_HID
          {
            // Lazily initialise shadow from global on first run.
            if (!sct_shadow_initialised_b) {
              global_dap_config_class.getConfig(&sct_shadow_config_st, 500);
              sct_shadow_initialised_b = true;
            }

            DapAttrPacket_t attr_pkt;
            // Re-usable action struct for ACTION class packets.
            // Fields accumulate until DAP_ATTR_ACT_EXECUTE is received.
            DapActions_t pending_action;
            memset(&pending_action, 0, sizeof(pending_action));
            bool has_pending_action_b = false;

            while (VendorHID_ReadAttrPacket(&attr_pkt)) {

              if (attr_pkt.classId_u8 == (uint8_t)DAP_ATTR_CLASS_CONFIG) {

                if (attr_pkt.cmdType_u8 == (uint8_t)DAP_ATTR_CMD_WRITE) {

                  if (attr_pkt.attrId_u16 == (uint16_t)DAP_ATTR_CFG_STORE_TO_EEPROM) {
                    // Set the storeToEeprom flag on the shadow header.
                    sct_shadow_config_st.payloadHeader_st.storeToEeprom_u8 =
                        (attr_pkt.value_i64 != 0) ? 1u : 0u;
                  } else if (attr_pkt.attrId_u16 == (uint16_t)DAP_ATTR_CFG_COMMIT) {
                    // Recalculate CRC and push shadow to config queue.
                    sct_shadow_config_st.payloadHeader_st.startOfFrame0_u8 = SOF_BYTE_0_U8;
                    sct_shadow_config_st.payloadHeader_st.startOfFrame1_u8 = SOF_BYTE_1_U8;
                    sct_shadow_config_st.payloadHeader_st.payloadType_u8   = DAP_PAYLOAD_TYPE_CONFIG_U8;
                    sct_shadow_config_st.payloadHeader_st.version_u8       = DAP_VERSION_CONFIG_U8;
                    sct_shadow_config_st.payloadFooter_st.enfOfFrame0_u8   = EOF_BYTE_0_U8;
                    sct_shadow_config_st.payloadFooter_st.enfOfFrame1_u8   = EOF_BYTE_1_U8;
                    uint16_t crc = checksumCalculator_u16(
                        (uint8_t*)(&sct_shadow_config_st.payloadHeader_st),
                        sizeof(sct_shadow_config_st.payloadHeader_st) +
                        sizeof(sct_shadow_config_st.payloadPedalConfig_st));
                    sct_shadow_config_st.payloadFooter_st.checkSum_u16 = crc;

                    configDataPackage_t cfgPkg;
                    cfgPkg.config_st = sct_shadow_config_st;
                    xQueueSend(s_configUpdateAvailableQueue, &cfgPkg, portMAX_DELAY);
                    ActiveSerial->println("Attr COMMIT: config pushed");

                    if (sct_shadow_config_st.payloadHeader_st.storeToEeprom_u8 == 1) {
                      Buzzer.single_beep_tone(700, 100);
                    }
                    // Clear eeprom flag so it doesn't persist
                    sct_shadow_config_st.payloadHeader_st.storeToEeprom_u8 = 0;
                  } else {
                    // Normal field write
                    DapAttr_ApplyToConfig(&sct_shadow_config_st.payloadPedalConfig_st, &attr_pkt);
                  }

                  // Send ACK
                  DapAttrPacket_t ack = attr_pkt;
                  ack.cmdType_u8 = (uint8_t)DAP_ATTR_CMD_ACK;
                  VendorHID_SendAttrReply(&ack);

                } else if (attr_pkt.cmdType_u8 == (uint8_t)DAP_ATTR_CMD_READ) {
                  DapAttrPacket_t reply = attr_pkt;
                  reply.cmdType_u8 = (uint8_t)DAP_ATTR_CMD_ACK;
                  DapAttr_ReadFromConfig(&sct_shadow_config_st.payloadPedalConfig_st, &reply);
                  VendorHID_SendAttrReply(&reply);
                }

              } else if (attr_pkt.classId_u8 == (uint8_t)DAP_ATTR_CLASS_ACTION) {

                if (attr_pkt.cmdType_u8 == (uint8_t)DAP_ATTR_CMD_WRITE) {
                  if (attr_pkt.attrId_u16 == (uint16_t)DAP_ATTR_ACT_EXECUTE) {
                    // Execute all accumulated action fields
                    if (has_pending_action_b) {
                      // Inline the action dispatch (same logic as legacy struct path below)
                      // ---- start ExecuteAction inline ----
                      if (pending_action.payloadPedalAction_st.systemAction_u8 == 2) {
                        ActiveSerial->println("ESP restart by user request");
                        ESP.restart();
                      }
                      #ifdef ESPNOW_Enable
                      if (pending_action.payloadPedalAction_st.systemAction_u8 == (uint8_t)PedalSystemAction::ENABLE_OTA) {
                        g_OTA_enable_b = true; g_ESPNow_OTA_enable = false;
                      }
                      #endif
                      if (pending_action.payloadPedalAction_st.triggerAbs_u8 > 0) {
                        absOscillation.trigger();
                        dap_calculationVariables_st.trackCondition_u8 =
                            (pending_action.payloadPedalAction_st.triggerAbs_u8 > 1)
                            ? (pending_action.payloadPedalAction_st.triggerAbs_u8 - 1) : 0;
                      }
                      _RPMOscillation.rpmValue_fl32 = pending_action.payloadPedalAction_st.rpm_u8;
                      gForceEffect_.gValue_fl32     = pending_action.payloadPedalAction_st.gValue_u8 - 128;
                      if (pending_action.payloadPedalAction_st.wheelSlip_u8) _WSOscillation.trigger();
                      if (!dap_calculationVariables_st.rudderStatus_b)
                        roadImpactEffect_.roadImpactValue_u8 = pending_action.payloadPedalAction_st.impactValue_u8;
                      if (pending_action.payloadPedalAction_st.startSystemIdentification_u8) systemIdentificationMode_b = true;
                      if (pending_action.payloadPedalAction_st.triggerCv1_u8) customVibration1_.trigger();
                      if (pending_action.payloadPedalAction_st.triggerCv2_u8) customVibration2_.trigger();
                      if (pending_action.payloadPedalAction_st.triggerCv3_u8) customVibration3_.trigger();
                      if (pending_action.payloadPedalAction_st.triggerCv4_u8) customVibration4_.trigger();
                      if (pending_action.payloadPedalAction_st.returnPedalConfig_u8) {
                        sct_dap_config_st.payloadHeader_st.startOfFrame0_u8 = SOF_BYTE_0_U8;
                        sct_dap_config_st.payloadHeader_st.startOfFrame1_u8 = SOF_BYTE_1_U8;
                        sct_dap_config_st.payloadFooter_st.enfOfFrame0_u8   = EOF_BYTE_0_U8;
                        sct_dap_config_st.payloadFooter_st.enfOfFrame1_u8   = EOF_BYTE_1_U8;
                        uint16_t crc2 = checksumCalculator_u16(
                            (uint8_t*)(&sct_dap_config_st.payloadHeader_st),
                            sizeof(sct_dap_config_st.payloadHeader_st) +
                            sizeof(sct_dap_config_st.payloadPedalConfig_st));
                        sct_dap_config_st.payloadFooter_st.checkSum_u16 = crc2;
                        vTaskSuspend(handle_serialCommunicationTx);
                        delay(50);
                        ActiveSerial->write((char*)&sct_dap_config_st, sizeof(DapConfig_t));
                        delay(50);
                        vTaskResume(handle_serialCommunicationTx);
                      }
                      #ifdef ESPNOW_Enable
                      if (pending_action.payloadPedalAction_st.rudderAction_u8 == 1) {
                        if (!dap_calculationVariables_st.rudderStatus_b) { dap_calculationVariables_st.rudderStatus_b = true; Rudder_initializing = true; moveSlowlyToPosition_b = true; }
                        else { dap_calculationVariables_st.rudderStatus_b = false; Rudder_deinitializing = true; moveSlowlyToPosition_b = true; }
                      }
                      if (pending_action.payloadPedalAction_st.rudderAction_u8 == 2) {
                        dap_calculationVariables_st.rudderStatus_b = false; dap_calculationVariables_st.rudderBrakeStatus_b = false; Rudder_deinitializing = true; moveSlowlyToPosition_b = true;
                      }
                      if (pending_action.payloadPedalAction_st.rudderBrakeAction_u8 == 1) {
                        dap_calculationVariables_st.rudderBrakeStatus_b = !dap_calculationVariables_st.rudderBrakeStatus_b;
                      }
                      #endif
                      // ---- end ExecuteAction inline ----
                      memset(&pending_action, 0, sizeof(pending_action));
                      has_pending_action_b = false;
                    }
                  } else {
                    DapAttr_ApplyToAction(&pending_action, &attr_pkt);
                    has_pending_action_b = true;
                  }

                  // ACK every WRITE
                  DapAttrPacket_t ack = attr_pkt;
                  ack.cmdType_u8 = (uint8_t)DAP_ATTR_CMD_ACK;
                  VendorHID_SendAttrReply(&ack);
                }
              }
            } // while VendorHID_ReadAttrPacket
          }
          #endif // USE_VENDOR_HID

          // Activate profiler based on config
          profiler_serialCommunicationTask.start(0);

          // --- 1. Read all available data into our buffer ---
          #ifdef USE_VENDOR_HID
            {
              size_t pktLen = RX_BUFFER_SIZE - buffer_len;
              if (pktLen > 0 && VendorHID_ReadPacket(&rx_buffer[buffer_len], &pktLen)) {
                buffer_len += pktLen;
              }
            }
          #else
            if (ActiveSerial->available())
            {
              size_t bytesToRead = min((size_t)ActiveSerial->available(), RX_BUFFER_SIZE - buffer_len);
              if (bytesToRead > 0)
              {
                  ActiveSerial->readBytes(&rx_buffer[buffer_len], bytesToRead);
                  buffer_len += bytesToRead;
              }
            }
          #endif

          // --- 2. Process all complete packets in the buffer ---
          size_t buffer_idx = 0;
            while (buffer_idx < buffer_len)
            {
              // A. Find the next valid Start-of-Frame (SOF)
              if (rx_buffer[buffer_idx] != SOF_BYTE_0_U8 || (buffer_idx + 1 < buffer_len && rx_buffer[buffer_idx + 1] != SOF_BYTE_1_U8))
              {
                  buffer_idx++;
                  continue; // Keep scanning for a SOF
              }

              // ActiveSerial->println("1st check passed");

              // SOF found at buffer_idx. Check if we have enough data for a header.
                if (buffer_len < buffer_idx + 3)
                {
                  // Not enough data for a full header, stop parsing for now
                  break;
              }

              // B. Get expected packet size from payload type
              uint8_t payloadType = rx_buffer[buffer_idx + 2];
              size_t expectedSize = getExpectedPacketSize(payloadType);

